test.yaml
config:
  target: 'nats://localhost:14222'
  phases:
    - arrivalRate: 1
      duration: 1
      name: Phase 1
scenarios:
  - name: 'Test scenario'
    engine: 'nats'
    flow:
      - loop:
          - log:  'hi'
          - log:  'hey'
        count: 5
      - request:
          subject: 'ping'
      - request:
          subject: 'time'
      # TODO test capturing
      - log:  'done'