test.yaml
config:
  target: 'nats://localhost:14222'
  engines:
    nats: {}
  phases:
    - arrivalRate: 1
      duration: 1
      name: Phase 1
scenarios:
  - name: 'Test scenario'
    engine: 'nats'
    flow:
      - loop:
          - log:  'hi'
          - log:  'hey'
        count: 5
      - request:
          subject: 'ping'
      - request:
          subject: 'time'
      - request:
          subject: 'get-code'
          capture:
            - json: '$.code'
              as: 'code'
      - request:
          subject: 'code-{{ code }}'
      - log:  'done'