test.yaml
config:
  # target: 'nats://localhost:14222'
  phases:
    - arrivalRate: 1
      duration: 1
      name: Phase 1
  engines:
    nats:
      servers: 'nats://localhost:14222'
scenarios:
  - name: 'Test scenario'
    engine: 'nats'
    flow:
      - loop:
          - log:  'hi'
          - log:  'hey'
        count: 5
      # - do: something
      # - do: othe something
      - request:
          subject: 'ping'
      - request:
          subject: 'time'
      # - request:
      #     subject: 'foo-json'
      #     json:
      #       data: 'bar'
      #       foo: 'baz'
      - log:  'done'